app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "items".* FROM "items" WHERE "items"."category_id" = $1  [["category_id", 1]]
---
    def show
      @category = Category.find(params[:id])
      # get the items that are associated to @category.id
      @items = @category.items.all