app/views/categories/show.html.erb


<% @category.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."category_id" = $1  [["category_id", 1]]